Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ESULT_SUFFIX"                 = "_results.tsv"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SLICE_SIZE_MBP"                = "5"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3154000176518243652" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip" -> "builds/ea8185c0c094404623792dc05581e27c5254ca0cb20595080b9a17505d8a8b8c.zip"
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-pluginClinvar"
        name             = "svep-backend-pluginClinvar"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CLINVAR_REFERENCE"             = "clinvar.bed.gz"
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "FILTER_CLINVAR_EXCLUDE"        = "Benign,Benign/Likely benign,Likely benign,not provided"
              - "HTS_S3_HOST"                   = "s3.ap-southeast-3.amazonaws.com"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad"
              - "REFERENCE_LOCATION"            = "svep-backend-references-20250524134904629800000002"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "svep-backend-pluginConsequence:svep-backend-pluginConsequence-0"
        name        = "svep-backend-pluginConsequence-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250524134906107200000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:19:10.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "FASTA_REFERENCE_BASE"          = "Homo_sapiens.GRCh38.dna.chromosome"
              - "FILTER_CONSEQUENCE_RANK"       = "14"
              - "HTS_S3_HOST"                   = "s3.ap-southeast-3.amazonaws.com"
              - "MIRNA_REFERENCE"               = "sorted_filtered_mirna.gff3.bgz"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar"
              - "REFERENCE_LOCATION"            = "svep-backend-references-20250524134904629800000002"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SPLICE_REFERENCE"              = "sorted_splice.Homo_sapiens.GRCh38.gtf.bgz"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250524134906107200000005"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-pluginGnomad"
        name             = "svep-backend-pluginGnomad"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-formatOutput",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "FILTER_MAX_MAF"                = "0.05"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-formatOutput"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginGnomadConstraint/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/fa01e559a72abd35a73a2ae40be4f4c86080b1f660e1a8acc42e5d7f21c22026.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/pluginGnomadConstraint'"
          + "filename_new"   = "builds/fa01e559a72abd35a73a2ae40be4f4c86080b1f660e1a8acc42e5d7f21c22026.zip"
          + "filename_old"   = "builds/fa01e559a72abd35a73a2ae40be4f4c86080b1f660e1a8acc42e5d7f21c22026.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginGnomadConstraint"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomadConstraint"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomadConstraint-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-pluginGnomadConstraint:*:*",
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-pluginGnomadConstraint:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomadConstraint"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomadConstraint",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomadConstraint-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomadConstraint",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomadConstraint"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad Constraint annotations to sVEP result rows."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-pluginGnomadConstraint"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/fa01e559a72abd35a73a2ae40be4f4c86080b1f660e1a8acc42e5d7f21c22026.zip"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginGnomadOneKG/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/de4809044c5c06b2cff5d4ba3f5d8569ffe2e9c88b6a2d1c4f78a1444a41e55f.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/pluginGnomadOneKG'"
          + "filename_new"   = "builds/de4809044c5c06b2cff5d4ba3f5d8569ffe2e9c88b6a2d1c4f78a1444a41e55f.zip"
          + "filename_old"   = "builds/de4809044c5c06b2cff5d4ba3f5d8569ffe2e9c88b6a2d1c4f78a1444a41e55f.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginGnomadOneKG"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomadOneKG"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomadOneKG-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-pluginGnomadOneKG:*:*",
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-pluginGnomadOneKG:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomadOneKG"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomadOneKG",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomadOneKG-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomadOneKG",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomadOneKG"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad 1kg annotations to sVEP result rows."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-pluginGnomadOneKG"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/de4809044c5c06b2cff5d4ba3f5d8569ffe2e9c88b6a2d1c4f78a1444a41e55f.zip"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:5fbf7036631d78dfaef8bbab23bff1d0f1cd153b50269678143542533a34f1c4" -> (known after apply)
      ~ last_modified                  = "2025-05-30T07:05:56.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-queryGTF"
        name             = "svep-backend-queryGTF"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "FILTER_GENES"                  = "APOB,LDLR,PCSK9"
              - "HTS_S3_HOST"                   = "s3.ap-southeast-3.amazonaws.com"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"   = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence"
              - "REFERENCE_GENOME"              = "sorted_filtered_Homo_sapiens.GRCh38.gtf.bgz"
              - "REFERENCE_LOCATION"            = "svep-backend-references-20250524134904629800000002"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/72b4322763cd5a81dc2bcd1c08b81310f0079bfccfedaf3c78d527e54352b77f.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/72b4322763cd5a81dc2bcd1c08b81310f0079bfccfedaf3c78d527e54352b77f.zip"
          + "filename_old"   = "builds/72b4322763cd5a81dc2bcd1c08b81310f0079bfccfedaf3c78d527e54352b77f.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-queryVCF"
        name             = "svep-backend-queryVCF"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-queryVCF/builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip" -> (known after apply)
        id                             = "svep-backend-queryVCF"
      ~ last_modified                  = "2025-05-30T06:52:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA"  = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"       = "sbeacon-dataportal-clinic-jobs"
              - "FILTER_MIN_QUAL"                = "10"
              - "HTS_S3_HOST"                    = "s3.ap-southeast-3.amazonaws.com"
              - "NEXT_FUNCTION_SNS_TOPIC_ARN"    = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF"
              - "QUERY_VCF_SUBMIT_SNS_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit"
              - "SEND_JOB_EMAIL_ARN"             = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
              - "SLICE_SIZE_MBP"                 = "5"
              - "SVEP_TEMP"                      = "svep-backend-temp-20250524134904624400000001"
              - "USER_POOL_ID"                   = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1053675694286720007" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip" -> "builds/72b4322763cd5a81dc2bcd1c08b81310f0079bfccfedaf3c78d527e54352b77f.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-queryVCFsubmit"
        name             = "svep-backend-queryVCFsubmit"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail" -> null
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-sendJobEmail/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/41c3d71c111af11fab64a690b72d6c661d398bdacf3f8e1062b642eb74612a3c.zip' 'python3.12' '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/200/default/svep/lambda/sendJobEmail'"
          + "filename_new"   = "builds/41c3d71c111af11fab64a690b72d6c661d398bdacf3f8e1062b642eb74612a3c.zip"
          + "filename_old"   = "builds/41c3d71c111af11fab64a690b72d6c661d398bdacf3f8e1062b642eb74612a3c.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-sendJobEmail"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::127214202110:policy/svep-backend-sendJobEmail"
        name             = "svep-backend-sendJobEmail"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-sendJobEmail/builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip" -> (known after apply)
        id                             = "svep-backend-sendJobEmail"
      ~ last_modified                  = "2025-05-30T06:52:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                  = "ap-southeast-3_586AXnWYN"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6203726737728683064" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip" -> "builds/41c3d71c111af11fab64a690b72d6c661d398bdacf3f8e1062b642eb74612a3c.zip"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "svep-backend-updateReferenceFiles:svep-backend-updateReferenceFiles-0"
        name        = "svep-backend-updateReferenceFiles-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-updateReferenceFiles"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/svep-references"
                    },
                  - {
                      - Action   = [
                          - "ec2:RunInstances",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeImages",
                          - "ec2:CreateTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::127214202110:role/svep_backend_ec2_references_instance_role"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip" -> "builds/89738cd9a665a75077dd2e1be90c330dbddc0afb3d3a64983195a60683990fee.zip"
        id                             = "svep-backend-updateReferenceFiles"
      ~ last_modified                  = "2025-05-30T06:52:08.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "GNOMAD_CONSTRAINTS_VERSION"         = "4.1"
                # (8 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/89738cd9a665a75077dd2e1be90c330dbddc0afb3d3a64983195a60683990fee.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/89738cd9a665a75077dd2e1be90c330dbddc0afb3d3a64983195a60683990fee.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9137019707929139284" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip" -> "builds/89738cd9a665a75077dd2e1be90c330dbddc0afb3d3a64983195a60683990fee.zip"
          ~ "timestamp" = "1748587724483576000" -> "1750238485325461000"
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2" -> (known after apply)
      ~ code_sha256                 = "9CLb31B5aj6rx5c5gSzGE9zVc/PKmPd3BVjs2NdYSdg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-24T13:49:45.588+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" -> "builds/8aa987b4bad6946726623a9b7d08e5d96d8e93a681d1f0976a35340cf8fa47d7.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 11922 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250524134904786200000004/builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "bdfbeef2d18106cf8a28cc3e4f9b0e2e" -> (known after apply)
      ~ id                            = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" -> (known after apply)
      ~ key                           = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" -> "builds/8aa987b4bad6946726623a9b7d08e5d96d8e93a681d1f0976a35340cf8fa47d7.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" -> "builds/8aa987b4bad6946726623a9b7d08e5d96d8e93a681d1f0976a35340cf8fa47d7.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8aa987b4bad6946726623a9b7d08e5d96d8e93a681d1f0976a35340cf8fa47d7.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8aa987b4bad6946726623a9b7d08e5d96d8e93a681d1f0976a35340cf8fa47d7.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3597477359270369049" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip" -> "builds/8aa987b4bad6946726623a9b7d08e5d96d8e93a681d1f0976a35340cf8fa47d7.zip"
          ~ "timestamp" = "1748587724629647000" -> "1750238485258534000"
        }
    }

Plan: 106 to add, 111 to change, 55 to destroy.
╷
│ Error: Cycle: module.svep.aws_api_gateway_integration_response.submit-patch (expand), module.svep.aws_api_gateway_integration.submit-post (expand), module.svep.aws_api_gateway_integration_response.submit-post (expand), module.svep[0].module.lambda-concat.aws_lambda_function.lambda[0], module.svep[0].module.lambda-concatStarter.aws_iam_policy.additional[0], module.svep[0].module.lambda-pluginClinvar.aws_iam_policy.additional[0], module.webgui.aws_cloudfront_distribution.bui-s3-distribution (expand), module.webgui.null_resource.cloudfront-invalidate (expand), module.webgui.null_resource.cloudfront-invalidate, module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.additional[0], module.svep[0].module.lambda-createPages.aws_iam_policy.additional[0], module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0], module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0], module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.additional[0], module.svep[0].module.lambda-concatPages.aws_lambda_function.lambda[0], module.webgui.data.external.build (expand), module.webgui.null_resource.s3-upload (expand), module.webgui.null_resource.s3-upload, module.svep[0].module.lambda-concat.aws_iam_policy.additional[0], module.svep[0].module.lambda-initQuery.aws_iam_policy.additional[0], module.svep[0].module.lambda-formatOutput.aws_iam_policy.additional[0], module.svep.aws_cloudfront_distribution.api_distribution (expand), module.svep.output.api_url (expand), local.clinic_api_url (expand), module.webgui.var.api_endpoint_clinic (expand), module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy (expand), module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy, module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0], module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.additional[0], module.svep[0].module.lambda-concatPages.aws_iam_policy.additional[0], module.svep[0].module.lambda-queryGTF.aws_iam_policy.additional[0], module.svep.module.lambda-pluginConsequence.aws_lambda_function.this (expand), module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0], module.svep[0].module.lambda-formatOutput.aws_lambda_function.lambda[0], module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.additional_jsons[0], module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0], module.svep[0].module.lambda-concatStarter.aws_lambda_function.lambda[0], module.svep.aws_api_gateway_method_settings.VPApi (expand), module.svep[0].aws_api_gateway_method_settings.VPApi, module.svep[0].module.lambda-createPages.aws_lambda_function.lambda[0], module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0], module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0], module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0], module.cognito.module.lambda-sendSvepJobEmail.aws_lambda_function.this[0] (destroy), module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] (destroy), module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0], module.svep.module.lambda-initQuery.output.function_invoke_arn (expand), module.svep.aws_api_gateway_integration.submit-patch (expand), module.svep.aws_api_gateway_deployment.VPApi (expand), module.svep.aws_api_gateway_stage.VPApi (expand)
│ 
│ 
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat02-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat02-plan.out"
❌ Terraform plan creation failed
❌ Terraform plan failed
❌ Main execution failed
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
❌ Script failed with exit code: 1


```
</details>